In [1]:
import configparser

import psycopg2
import pandas as pd

In [2]:
users_query = """Select * from users;"""
time_query = """Select * from time;"""
songs_query = """Select * from songs;"""
artists_query = """Select * from artists;"""

In [3]:
config = configparser.ConfigParser()
config.read('dwh.cfg')

connection = psycopg2.connect("host={} dbname={} user={} password={} port={}".format(*config['REDSHIFT'].values()))
cursor = connection.cursor()

In [4]:
cursor.execute(time_query)
time = cursor.fetchall()
time_df = pd.DataFrame(time, columns=["start_time", "year", "month", "day", "hour", "week", "weekday"])
time_df.head()

           start_time  year  month  day  hour  week  weekday
0 2018-11-01 21:05:52  2018     11    1    21    44        4
1 2018-11-01 21:55:25  2018     11    1    21    44        4
2 2018-11-02 05:52:29  2018     11    2     5    44        5
3 2018-11-02 09:22:43  2018     11    2     9    44        5
4 2018-11-02 09:54:59  2018     11    2     9    44        5

In [5]:
cursor.execute(users_query)
users = cursor.fetchall()
users_df = pd.DataFrame(users, columns=["user_id", "first_name", "last_name", "gender", "level"])
users_df.head()

   user_id first_name last_name gender level
0       66      Kevin  Arellano      M  free
1       34     Evelin     Ayala      F  free
2       99        Ann     Banks      F  free
3      100      Adler   Barrera      M  free
4       42     Harper   Barrett      M  paid

In [6]:
cursor.execute(artists_query)
artists = cursor.fetchall()
artists_df = pd.DataFrame(artists, columns=["artist_id", "name", "location", "latitude", "longitude"])
artists_df.head()

   artist_id                  name location  latitude  longitude
0       2042                   !!!                NaN        NaN
1       2472  'N Sync/Phil Collins     None       NaN        NaN
2       2966    + / - {Plus/Minus}     None       NaN        NaN
3        866                   +44     None       NaN        NaN
4       2983          1 Mile North     None       NaN        NaN

In [7]:
cursor.execute(songs_query)
songs = cursor.fetchall()
songs_df = pd.DataFrame(songs, columns=["song_id", "title", "artist_id", "year", "duration"])
songs_df.head()

   song_id                         title  artist_id  year  duration
0     4561   I Will Not Reap Destruction       2812   NaN       NaN
1     3321                           #40       1937   NaN       NaN
2     4151               'Round Midnight       2620   NaN       NaN
3      883              'Till I Collapse        733   NaN       NaN
4     1632            (Hon Vill Ha) Puls       1228   NaN       NaN

In [8]:
songplays_query = """Select * from songplays;"""
cursor.execute(songplays_query)
songplays = cursor.fetchall()
songplays_df = pd.DataFrame(songplays, columns=["songplay_id", "session_id", "start_time", "artist_id", "song_id", "user_id", "level", "location", "user_agent"])
songplays_df.head()

,songplay_id,session_id,start_time,artist_id,song_id,user_id,level,location,user_agent
0,9,0,2018-11-01 21:42:00,460,525,10,free,"Washington-Arlington-Alexandria, DC-VA-MD-WV","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
1,118,0,2018-11-02 05:15:41,7,674,17,free,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK..."
2,172,5,2018-11-02 09:19:15,579,679,15,paid,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."
3,172,13,2018-11-02 09:50:23,587,687,15,paid,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."
4,172,21,2018-11-02 10:19:18,594,695,15,paid,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."

In [9]:
users_df.shape == users_df.drop_duplicates(subset=["user_id"]).shape

True

In [10]:
time_df.shape == time_df.drop_duplicates(subset=["start_time"]).shape

True

In [11]:
artists_df.shape == artists_df.drop_duplicates(subset=["name"]).shape

True

In [12]:
songs_df.shape == songs_df.drop_duplicates(subset=["title", "artist_id"]).shape

True

In [13]:
songplays_df.shape == songplays_df.drop_duplicates(subset=["session_id", "session_id", "start_time", "artist_id", "song_id", "user_id"]).shape

True

In [14]:
connection.close()